In [1]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
import pandas as pd
import numpy as np

In [5]:
df=pd.read_csv('examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
pd.read_table('examples/ex1.csv', sep='||')                 # 값 구분자 설정 (금액 데이터에서는 다른 기호로 설정해야한다.)

/Users/linc/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.
/Users/linc/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

,Unnamed: 0,a,",",b,",.1",c,",.2",d,",.3",m,e,s,s.1,a.1,g,e.1,Unnamed: 16
0,NaN,1,",",2,",",3,",",4,",",h,e,l,l,o,NaN,NaN,NaN
1,NaN,5,",",6,",",7,",",8,",",w,o,r,l,d,NaN,NaN,NaN
2,NaN,9,",",1,0,",",1,1,",",1,2,",",f,o,o,NaN,NaN

In [7]:
!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [13]:
pd.read_csv('examples/ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [15]:
pd.read_csv('examples/ex2.csv',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
names = ['a','b','c','d','message']
pd.read_csv('examples/ex2.csv',names=names, index_col = 'message') 

#message가 index_column이 되어서 message에 포함된 값들이 index가 된다

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [19]:
!cat examples/csv_mindex.csv
parsed = pd.read_csv('examples/csv_mindex.csv',
                    index_col = ['key1','key2'])
parsed

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [22]:
a=list(open('examples/ex3.txt'))

In [26]:
type(a)

list

In [35]:
result = pd.read_table('examples/ex3.txt',sep='\s+')        # space bar
result

/Users/linc/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [29]:
!cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [31]:
pd.read_csv('examples/ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [32]:
!cat examples/ex5.csv
result = pd.read_csv('examples/ex5.csv')
result
pd.isnull(result)

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [33]:
result = pd.read_csv('examples/ex5.csv',na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [36]:
sentinels={'message':['foo','NA'],'something':['two']}    # 상위:하위
pd.read_csv('examples/ex5.csv',na_values=sentinels        # null = na_values

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [44]:
result = pd.read_csv('examples/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [45]:
pd.read_csv('examples/ex6.csv',nrows=5)      #행 5개만 읽어옴

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [47]:
chunker = pd.read_csv('examples/ex6.csv',chunksize = 1000)
chunker

In [48]:
chunker = pd.read_csv('examples/ex6.csv',chunksize=1000)

tot=pd.Series([])            # 새로운 tot table에 값들을 행 단위로 저장
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value=0)
tot=tot.sort_values(ascending=False)

In [57]:
tot[:100]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
     ...
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
Length: 36, dtype: float64

In [62]:
piece['key'].value_counts()

K    42
M    41
U    39
P    38
Y    38
     ..
2    15
9    15
8    15
7    14
1    12
Name: key, Length: 36, dtype: int64

In [64]:
pd.read_csv('examples/out.csv')

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo

In [65]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [66]:
data = pd.read_csv('examples/ex2.csv')
data

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [67]:
data.to_csv('examples/out.csv')

In [68]:
!cat examples/out.csv

,1,2,3,4,hello
0,5,6,7,8,world
1,9,10,11,12,foo

In [70]:
data = pd.read_csv('examples/ex5.csv')   # CSV 파일로부터 데이터를 읽어 데이터프레임을 만들 때는 pandas.read_csv() 명령을 사용
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [71]:
import sys
data.to_csv(sys.stdout, sep='|')  # 데이터프레임 값을 CSV 파일로 출력하고 싶으면 to_csv() 메서드를 사용

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [77]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [78]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [79]:
data.to_csv(sys.stdout, index=False, columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [81]:
dates=pd.date_range('1/1/2000',periods=7)
ts=pd.Series(np.arange(7), index=dates)
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int64

In [82]:
ts.to_csv('examples/tseries.csv')

/Users/linc/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

In [83]:
!cat examples/tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [84]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [85]:
import csv                     # csv파일을 읽기 위해 csv모듈을 import함
f = open('examples/ex7.csv')   # csv 파일을 오픈하고 파일객체 f에 넣음
reader = csv.reader(f)         # 파일객체를 csv.reader(파일객체) 에 넣음

In [87]:
f

In [88]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [94]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [90]:
header, values = lines[0], lines[1:]

In [93]:
array = pd.read_csv('examples/ex1.csv')
array

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [97]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [98]:
header, values = lines[0],lines[1:]

In [99]:
data_dict = {h: v for h, v in zip(header, zip(*values))}   # 동일한 개수로 이루어진 자료형을 묶어 주는 역할을 하는 함수
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [101]:
obj = """            
{"name":"Wes",
"places_lived":["United States", "Spain","Germany"],
"pet":null} """ # 긴 스트링 저장할 때 """

In [102]:
obj

'\n{"name":"Wes",\n"places_lived":["United States", "Spain","Germany"],\n"pet":null} '

In [103]:
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None}

In [104]:
asjson = json.dumps(result)